{"_id":{"$oid":"5d76b174934ef619061878d8"},"Title":"Kingsman: The Secret Service","Description":"Gary \"Eggsy\" Unwin (Taron Egerton), whose late father secretly worked for a spy organization, lives in a South London housing estate and seems headed for a life behind bars. However, dapper agent Harry Hart (Colin Firth) recognizes potential in the youth and recruits him to be a trainee in the secret service.","Genre":{"Name":"Action","Description":"Action film is a film genre in which the protagonist or protagonists are thrust into a series of events that typically include violence, extended fighting, physical feats, and frantic chases."},"Director":{"Name":"Matthew Vaughn","Birth":"March 7, 1971","Bio":"Matthew Vaughn is an English film producer and director."},"Featured":true,"ImagePath":"kingsman1.png"}
{"_id":{"$oid":"5d77d26d934ef619061878d9"},"Title":"Kingsman: The Golden Circle","Description":"With their headquarters destroyed and the world held hostage, members of Kingsman find new allies when they discover a spy organization in the United States known as Statesman. In an adventure that tests their strength and wits, the elite secret agents from both sides of the pond band together to battle a ruthless enemy and save the day, something that's becoming a bit of a habit for Eggsy.","Genre":{"Name":"Action","Description":"Action film is a film genre in which the protagonist or protagonists are thrust into a series of events that typically include violence, extended fighting, physical feats, and frantic chases."},"Director":{"Name":"Matthew Vaughn","Birth":"March 7, 1971","Bio":"Matthew Vaughn is an English film producer and director."},"ImagePath":"kingsman2.png","Featured":true}
{"_id":{"$oid":"5d77d332934ef619061878da"},"Title":"The Greatest Showman","Description":"Growing up in the early 1800s, P.T. Barnum displays a natural talent for publicity and promotion, selling lottery tickets by age 12. After trying his hands at various jobs, P.T. turns to show business to indulge his limitless imagination, rising from nothing to create the Barnum & Bailey circus. Featuring catchy musical numbers, exotic performers and daring acrobatic feats, Barnum's mesmerizing spectacle soon takes the world by storm to become the greatest show on Earth.","Genre":{"Name":"Musical","Description":"Musical film is a film genre in which songs sung by the characters are interwoven into the narrative, sometimes accompanied by dancing."},"Director":{"Name":"Michael Gracey","Birth":"N/A","Bio":"Michael Gracey is an Australian director and visual effects artist."},"ImagePath":"thegreatestshowman.png","Featured":true}
{"_id":{"$oid":"5d77d40d934ef619061878db"},"Title":"Night at the Museum","Description":"Night at the Museum is a trilogy of fantasy-comedy films beginning in 2006 and ending in 2014. All three films, based on the children's book The Night at the Museum by Milan Trenc, are directed by Shawn Levy and written by Robert Ben Garant and Thomas Lennon.","Genre":{"Name":"Comedy","Description":"A comedy film is a genre of film in which the main emphasis is on humour. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Shawn Levy","Birth":"23 July 1968","Bio":"Shawn Adam Levy is a Canadian film director, producer and actor."},"ImagePath":"nightatthemuseum.png","Featured":true}
{"_id":{"$oid":"5d77d4cd934ef619061878dc"},"Title":"Now You See Me","Description":"Charismatic magician Atlas (Jesse Eisenberg) leads a team of talented illusionists called the Four Horsemen. Atlas and his comrades mesmerize audiences with a pair of amazing magic shows that drain the bank accounts of the corrupt and funnel the money to audience members. A federal agent (Mark Ruffalo) and an Interpol detective (Mélanie Laurent) intend to rein in the Horsemen before their next caper, and they turn to Thaddeus (Morgan Freeman), a famous debunker, for help.","Genre":{"Name":"Action","Description":"Action film is a film genre in which the protagonist or protagonists are thrust into a series of events that typically include violence, extended fighting, physical feats, and frantic chases."},"Director":{"Name":"Louis Leterrier","Birth":"17 June 1973","Bio":"Louis Leterrier is a French film director."},"ImagePath":"nowyouseeme.png","Featured":true}
{"_id":{"$oid":"5d77d723934ef619061878dd"},"Title":"Hairspray","Description":"In 1960s Baltimore, dance-loving teen Tracy Turnblad (Nikki Blonsky) auditions for a spot on \"The Corny Collins Show\" and wins. She becomes an overnight celebrity, a trendsetter in dance, fun and fashion. Perhaps her new status as a teen sensation is enough to topple Corny's reigning dance queen and bring racial integration to the show.","Genre":{"Name":"Musical","Description":"Musical film is a film genre in which songs sung by the characters are interwoven into the narrative, sometimes accompanied by dancing."},"Director":{"Name":"Adam Shankman","Birth":"27 November 1964","Bio":"Adam Michael Shankman is an American film director, producer, dancer, author, actor, and choreographer."},"ImagePath":"hairspray.png","Featured":true}
{"_id":{"$oid":"5d77d7da934ef619061878de"},"Title":"Harry Potter and the Chamber of Secrets","Description":"A mysterious elf tells Harry to expect trouble during his second year at Hogwarts, but nothing can prepare him for trees that fight back, flying cars, spiders that talk and deadly warnings written in blood on the walls of the school.","Genre":{"Name":"Fantasy","Description":"Fantasy films are films that belong to the fantasy genre with fantastic themes, usually magic, supernatural events, mythology, folklore, or exotic fantasy worlds. "},"Director":{"Name":"Chris Columbus","Birth":"10 September 1958","Bio":"Chris Joseph Columbus is an American filmmaker. "},"ImagePath":"harrypotter2.png","Featured":true}
{"_id":{"$oid":"5d77d88c934ef619061878df"},"Title":"The Hobbit: An Unexpected Journey","Description":"Bilbo Baggins (Martin Freeman) lives a simple life with his fellow hobbits in the shire, until the wizard Gandalf (Ian McKellen) arrives and convinces him to join a group of dwarves on a quest to reclaim the kingdom of Erebor. The journey takes Bilbo on a path through treacherous lands swarming with orcs, goblins and other dangers, not the least of which is an encounter with Gollum (Andy Serkis) and a simple gold ring that is tied to the fate of Middle Earth in ways Bilbo cannot even fathom.","Genre":{"Name":"Fantasy","Description":"Fantasy films are films that belong to the fantasy genre with fantastic themes, usually magic, supernatural events, mythology, folklore, or exotic fantasy worlds."},"Director":{"Name":"Peter Jackson","Birth":"31 October 1961","Bio":"Sir Peter Robert Jackson ONZ KNZM is a New Zealand film director, screenwriter, and film producer."},"ImagePath":"hobbit1.png","Featured":true}
{"_id":{"$oid":"5d77d962934ef619061878e0"},"Title":"The Lord of the Rings: The Fellowship of the Ring","Description":"The future of civilization rests in the fate of the One Ring, which has been lost for centuries. Powerful forces are unrelenting in their search for it. But fate has placed it in the hands of a young Hobbit named Frodo Baggins (Elijah Wood), who inherits the Ring and steps into legend.","Genre":{"Name":"Fantasy","Description":"Fantasy films are films that belong to the fantasy genre with fantastic themes, usually magic, supernatural events, mythology, folklore, or exotic fantasy worlds."},"Director":{"Name":"Peter Jackson","Birth":"31 October 1961","Bio":"Sir Peter Robert Jackson ONZ KNZM is a New Zealand film director, screenwriter, and film producer."},"ImagePath":"lordofthering1.png","Featured":true}
{"_id":{"$oid":"5d77da61934ef619061878e1"},"Title":"Rocketman","Description":"Young Reginald Dwight changes his name to Elton John and collaborates with singer-songwriter Bernie Taupin to become one of the most iconic figures in pop history. Set to his most beloved songs, it's the epic musical story of Elton John, his breakthrough years in the 1970s and his fantastical transformation from shy piano prodigy to international superstar.","Genre":{"Name":"Musical","Description":"Musical film is a film genre in which songs sung by the characters are interwoven into the narrative, sometimes accompanied by dancing."},"Director":{"Name":"Dexter Fletcher","Birth":"31 January 1966","Bio":"Dexter Fletcher is an English actor and director."},"ImagePath":"rocketman.png","Featured":true}